app/Controllers/CiudadanoController.php

SELECT *
FROM `ciudadanos`
---
    Public function index():string{

        $ciudadano =new CiudadanosModel();
        $datos['datos']=$ciudadano->findAll();