app/Controllers/DepartamentoController.php

    Public function index():string{

        $departamento =new DepartamentosModel();
        $datos['datos']=$departamento->findAll();
---
SELECT *
FROM `departamentos`