app/Controllers/MunicipioController.php

    public function index():string{

        $muni = new MunicipiosModel();
        $datos['datos']=$muni->findAll();
---
SELECT *
FROM `municipios`