app/Controllers/RegionesController.php

SELECT *
FROM `regiones`
---
    public function index(): string
    {
        //creando un objeto de tipo RegionesModel
        $region = new RegionesModel();
        $datos['datos']=$region->findAll();